using System;
using System.Collections.Generic;
using System.Text;

namespace Core.Net.Entity.Enums
{
    /// <summary>
    /// 订单类型
    /// </summary>
    public enum OrderTypeEnum
    {



//1.刷卡扣费：在消费终端上设定金额后，持卡人在终端设备上刷卡，终端设备向服务器发起扣费请求
//2.现金充值：在充值终端上设定金额后，持卡人在终端设备上刷卡，终端设备向服务器发起充值请求
//3.余额查询：在消费终端未设定金额时，持卡人在终端设备上刷卡，终端设备向服务器发起查询请求
//4.钱包转账：在转账终端上设定金额后，持卡人在终端设备上刷卡，终端设备向服务器发起转账请求


    }
    /// <summary>
    /// 订单状态
    /// </summary>
    public enum OrderStatusEnum
    {



        //1.刷卡扣费：在消费终端上设定金额后，持卡人在终端设备上刷卡，终端设备向服务器发起扣费请求
        //2.现金充值：在充值终端上设定金额后，持卡人在终端设备上刷卡，终端设备向服务器发起充值请求
        //3.余额查询：在消费终端未设定金额时，持卡人在终端设备上刷卡，终端设备向服务器发起查询请求
        //4.钱包转账：在转账终端上设定金额后，持卡人在终端设备上刷卡，终端设备向服务器发起转账请求


    }
}
